# Introduction

Cet examen se base sur les données météo france de 2018

# Import des modules

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# Lecture du fichier (1 pt)
Lire le fichier datas.csv dans un DataFrame df

In [3]:
df = pd.read_csv("meteo.csv", index_col=0)

# Aperçu du tableau (1 pt)
Afficher les 10 première lignes du DataFrame

In [91]:
df.head(10)

                         Date  Température  Pression au niveau mer  Humidité
Nom
TROYES-BARBEREY    2018-08-08      22.4250               101367.50    67.375
ROUEN-BOOS         2018-08-08      19.2750               101316.25    69.250
ORLY               2018-08-08      22.7750               101295.00    57.750
BALE-MULHOUSE      2018-08-08      25.0375               101310.00    61.250
TOULOUSE-BLAGNAC   2018-08-08      24.8250               101370.00    65.375
LA DESIRADE METEO  2018-08-08      28.9500               101712.50    72.000
TOURS              2018-08-08      21.6375               101375.00    62.000
GOURDON            2018-08-08      23.6125               101385.00    62.500
LE RAIZET AERO     2018-08-08      27.5625               101742.50    77.500
NANTES-BOUGUENAIS  2018-08-08      20.6000               101370.00    70.625

# Nombre de Colonnes (1 pt)
Afficher le nombre de colonnes dans le DataFrame

In [5]:
df.shape[1]

4

# Nombre de lignes (1 pt)
Afficher le nombre de lignes dans le DataFrame

In [6]:
df.shape[0]

19545

# Données manquantes (1 pt)
Afficher le nombre données manquantes par colonne

In [7]:
df.count()

Date                      19545
Température               19469
Pression au niveau mer    18616
Humidité                  19369
dtype: int64

In [35]:
aff=[df.shape[0]-df['Date'].count(), df.shape[0]-df['Température'].count(),df.shape[0]-df['Pression au niveau mer'].count(),df.shape[0]-df['Humidité'].count()]

In [36]:
aff

[0, 76, 929, 176]

# Suppression des manquants (1 pt)
Supprimer les lignes contenant des données manquantes

In [38]:
df.dropna().head(10)

                         Date  Température  Pression au niveau mer  Humidité
Nom
TROYES-BARBEREY    2018-08-08     295.5750               101367.50    67.375
ROUEN-BOOS         2018-08-08     292.4250               101316.25    69.250
ORLY               2018-08-08     295.9250               101295.00    57.750
BALE-MULHOUSE      2018-08-08     298.1875               101310.00    61.250
TOULOUSE-BLAGNAC   2018-08-08     297.9750               101370.00    65.375
LA DESIRADE METEO  2018-08-08     302.1000               101712.50    72.000
TOURS              2018-08-08     294.7875               101375.00    62.000
GOURDON            2018-08-08     296.7625               101385.00    62.500
LE RAIZET AERO     2018-08-08     300.7125               101742.50    77.500
NANTES-BOUGUENAIS  2018-08-08     293.7500               101370.00    70.625

In [40]:
df.dropna().shape

(18616, 4)

# Tri par nom et par date (2 pts)
Trier le DataFrame par nom et par date

In [42]:
df.sort_values(by=['Nom','Date'], inplace=False).head(10)

                 Date  Température  Pression au niveau mer  Humidité
Nom
ABBEVILLE  2018-01-01     280.2625               100145.00    82.000
ABBEVILLE  2018-01-02     277.8375               100348.75    77.000
ABBEVILLE  2018-01-03     270.7250                99900.00    58.250
ABBEVILLE  2018-01-04     279.9125               101096.25    77.500
ABBEVILLE  2018-01-05     281.8000               101203.75    75.500
ABBEVILLE  2018-01-06     288.4875               101907.50    93.125
ABBEVILLE  2018-01-07     298.1250               101126.25    54.125
ABBEVILLE  2018-01-08     292.4125               102166.25    67.750
ABBEVILLE  2018-01-09     288.6500               102590.00    66.375
ABBEVILLE  2018-01-10     283.7750               102403.75    67.000

# Passage en degrés Celsius (1 pt)
Transformer les températures en Kelvin en température en degrés Celsius

    pour rappel : T(K) = T(°C) + 273.15

In [50]:
df.Température=[x-273.15 for x in df.Température]

In [51]:
df.head(10)

                         Date  Température  Pression au niveau mer  Humidité
Nom
TROYES-BARBEREY    2018-08-08      22.4250               101367.50    67.375
ROUEN-BOOS         2018-08-08      19.2750               101316.25    69.250
ORLY               2018-08-08      22.7750               101295.00    57.750
BALE-MULHOUSE      2018-08-08      25.0375               101310.00    61.250
TOULOUSE-BLAGNAC   2018-08-08      24.8250               101370.00    65.375
LA DESIRADE METEO  2018-08-08      28.9500               101712.50    72.000
TOURS              2018-08-08      21.6375               101375.00    62.000
GOURDON            2018-08-08      23.6125               101385.00    62.500
LE RAIZET AERO     2018-08-08      27.5625               101742.50    77.500
NANTES-BOUGUENAIS  2018-08-08      20.6000               101370.00    70.625

# Création de l'indice THI (1 pt)
Créer une nouvelle colonne nommée THI (Temperature Humidity Index) calculée de la façon suivante :
    
    THI = T - ((0.55 - 0.0055*H) * (T - 14.5))
    avec T : Température en °C
    et H : Humidité relative en %

In [60]:
df['THI']=[x-((0.55-0.0055*y)*(x-14.5)) for (x,y) in (df.Température,df.Humidité)]

ValueError: too many values to unpack (expected 2)

In [83]:
df['THI']=[df.Température].pipe((x,y):x-((0.55-0.0055*y)*(x-14.5)) for (x,y) in (df.Température,df.Humidité))

SyntaxError: invalid syntax (<ipython-input-83-fec8b69ced73>, line 1)

In [79]:
df.drop(['THI'], axis=1, inplace=True)

In [ ]:
'''la fonction lambda ne semble pas s'appliquer pour une fonction de plusieurs variables. J'efface la colonne THI et passe à la suite'''

# Température moyenne (2 pts)
Donner la température moyenne par ville

In [102]:
temp=df.loc[:,['Température']]

In [103]:
tempmoy=temp.groupby(['Nom']).mean()

In [110]:
tempordonne=temp.groupby(['Nom'])

In [104]:
tempmoy.head()

               Température
Nom
ABBEVILLE        11.304258
AJACCIO          16.558680
ALENCON          11.590800
BALE-MULHOUSE    11.914379
BASTIA           16.537162

In [118]:
tempmoy.loc['ORLY']
'''température moyenne à Orly'''

'température moyenne à Orly'

In [121]:
tempordonne.head()

                     Température
Nom
TROYES-BARBEREY        22.425000
ROUEN-BOOS             19.275000
ORLY                   22.775000
BALE-MULHOUSE          25.037500
TOULOUSE-BLAGNAC       24.825000
LA DESIRADE METEO      28.950000
TOURS                  21.637500
GOURDON                23.612500
LE RAIZET AERO         27.562500
NANTES-BOUGUENAIS      20.600000
SAINT GEORGES          27.062500
ST GIRONS              21.062500
PERPIGNAN              25.612500
BORDEAUX-MERIGNAC      20.000000
PTE DE LA HAGUE        16.800000
ST-PIERRE              16.750000
ALENCON                16.325000
ORLY                   17.862500
LIMOGES-BELLEGARDE     18.050000
ABBEVILLE              15.525000
STRASBOURG-ENTZHEIM    23.200000
PLOUMANAC'H            16.425000
RENNES-ST JACQUES      15.937500
TOURS                  16.725000
GILLOT-AEROPORT        21.375000
REIMS-PRUNAY           17.837500
NANCY-OCHEY            20.175000
BOURGES                19.012500
BALE-MULHOUSE          21.900000
MONTPELLIER            25.687500
...                          ...
PAMANDZI               27.900000
MARIPASOULA            26.400000
PAMANDZI               27.583333
CAP CEPET               7.087500
MARIPASOULA            24.837500
PAMANDZI               28.340000
CAP CEPET               7.987500
MARIPASOULA            25.737500
MARIPASOULA            25.550000
MILLAU                  9.750000
CAP CEPET              14.712500
NOUVELLE AMSTERDAM     16.262500
SAINT LAURENT          25.475000
TRINITE-CARAVEL        26.412500
TRINITE-CARAVEL        26.142857
CROZET                 11.312500
TRINITE-CARAVEL        27.083333
TRINITE-CARAVEL        27.075000
CROZET                 10.328571
TRINITE-CARAVEL        25.116667
SAINT LAURENT          25.812500
SAINT LAURENT          26.575000
ST-BARTHELEMY METEO          NaN
ST-BARTHELEMY METEO          NaN
ST-BARTHELEMY METEO          NaN
JUAN DE NOVA           25.500000
JUAN DE NOVA           29.900000
JUAN DE NOVA           29.750000
JUAN DE NOVA           26.500000
JUAN DE NOVA           31.100000

[305 rows x 1 columns]

# Nombre de jours plus chauds que la moyenne à Orly (3 pts)
Donner, pour Orly, le nombre de jours avec une température supérieure à la température moyenne d'Orly

# Visualisation (2 pts)
Tracer le boxplot des valeurs de température à Orly

In [ ]:
plt.figure()
sns.boxplot(, orient='h')

# Classe (3 pts)
Créer une classe s'initialisant avec le DataFrame meteo.csv et proposant deux méthodes.
La première prend en argument un nom de ville et renvoie la température moyenne dans cette ville.
La seconde prend en argument une température et renvoie le nombre de villes pour lesquelles la température moyenne est supérieure à la température passée en argument de la méthode.

In [ ]:
class Meteo :
    def __init__(self,meteo):
        self.meteo=meteo
        
    def TempMoy(self,ville):